## Ejercicios:

1. Haz las importaciones necesarias para establecer la conxión y trabaar con Pandas.Establece la conexión usando mysql.connector utilizando try/except por si la conexión devielve un error.

2. Crea un nuevo "schema" llamado "alumnas-promo-X"   # OJO: GUIONES BAJOS EN SCHEMAS SIEMPRE. SI NO, DARÁ ERROR.

3. Crea una tabla con la información de las alumnas de la promo. Debe incluir: id_alumna, nombre, apellidos, ciudad y teléfono.

4. Inserta por lo menos 10 datos en la tabla creada en el ejercicio anterior (pueden ser inventados).

5. Haz una consulta que devuelva todos los registros de la tabla "alumnas" y conviértelo en Dataframe (no te olvides del nombre de las columnas).

6. Muestra los 3 primeros y tres últimos registros del Dataframe.

7. ¿Hay registros duplicados?

### Bonus:

8. Haz una consulta para extraer las diferentes ciudades en las que hay alumnas.

9. Crea al menos dos Dataframes con la información de las alumnas de dos ciudades diferentes (usando dos queries).

In [28]:
# Importar librería para la conexión con MySQL
# -----------------------------------------------------------------------
import mysql.connector
from mysql.connector import errorcode


# Importar librerías para manipulación y análisis de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np


# Intentamos hacer la conexión. No especifico la base de datos porque la voy a crear. 

try:
  cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              #database='tienda'
                            )
# en caso de que no lo consiga por que hay algún error entonces ...

except mysql.connector.Error as err:

  # si es un error con la contraseña me devuelve un mensaje de acceso denegado ya que tenemos problemas con la contraseña
  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  
  # si el error no tiene que ver con la contraseña, puede ser porque la base de datos no exista, devuelveme un mensaje de que la base de datos no existe
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  
  # si no es por ninguno de los errores anteriores, printeame cual es el error que estoy teniendo en mi conexión
  else:
    print(err)
else:
  # cnx.close() 
  print("Conexion realizada con éxito")

Conexion realizada con éxito

In [29]:
# Creo un objeto cursor con el conector creado anteriormente.
                          
mycursor = cnx.cursor()

# Escribo mi consulta:

query = "CREATE SCHEMA alumnas_promo_X1"

## Ejecuto la consulta en la base de datos y, si todo va correctamente, el resultado se almacenará en el cursor.

mycursor.execute(query)

#PD: Interesante aprender a hacerlo con gestion de errores. De momento tiro así.

DatabaseError: 1007 (HY000): Can't create database 'alumnas_promo_x1'; database exists

In [ ]:
print(type(mycursor))
print(f"mi cursor tiene esto: {mycursor}")

<class 'mysql.connector.cursor_cext.CMySQLCursor'>
mi cursor tiene esto: CMySQLCursor:  SELECT * FROM alumnas3

In [ ]:

# Creo una base de datos alumnas_promo_x1_via_codigo. ¿Es lo mismo que create schema??????

cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1')


mycursor = cnx.cursor()
try:
    mycursor.execute("CREATE DATABASE BD_alumnas_promo_x")
    print(mycursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

1007 (HY000): Can't create database 'bd_alumnas_promo_x'; database exists
Error Code: 1007
SQLSTATE HY000
Message Can't create database 'bd_alumnas_promo_x'; database exists

In [ ]:
# Preparo mi configuración para conectar con la base de datos 

config = {
  'user': 'root',
  'password': 'AlumnaAdalab',
  'host': '127.0.0.1',
  'database': 'BD_alumnas_promo_x',
  'raise_on_warnings': True
}

In [ ]:
# Crea una tabla con la información de las alumnas de la promo. Debe incluir: id_alumna, nombre, apellidos, ciudad y teléfono.

cnx = mysql.connector.connect(**config)


""" Antes hacía esto:  cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='BD_alumnas_promo_x') """ 

mycursor = cnx.cursor()

query = """CREATE TABLE alumnas3 (

    id_alumna INT AUTO_INCREMENT NOT NULL PRIMARY KEY,
    nombre VARCHAR(50) NOT NULL,
    apellidos VARCHAR(50) NOT NULL,
    ciudad VARCHAR(20) DEFAULT NULL, 
    telefono VARCHAR(10) DEFAULT NULL

)"""

mycursor.execute(query)

ProgrammingError: 1050 (42S01): Table 'alumnas3' already exists

In [ ]:
# 4. Inserta por lo menos 10 datos en la tabla creada en el ejercicio anterior (pueden ser inventados).


# El cnx sigue siendo el de antes, que conecta con la misma base de datos. El cursor, igual.

cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='BD_alumnas_promo_x')
mycursor = cnx.cursor()

val_alumna_1 = ("Lucía", "Gómez Hernández", "Madrid", "612345678")


query1 = """ INSERT INTO alumnas3 (nombre, apellidos, ciudad, telefono) VALUES (%s, %s, %s, %s)"""

mycursor.execute(query1, val_alumna_1)

In [ ]:
# Voy a insertar varias filas

query2 = """ INSERT INTO alumnas3 (nombre, apellidos, ciudad, telefono) VALUES (%s, %s, %s, %s)"""

datos_alumnas = [
("Ana", "Martínez López", "Barcelona", "623456789"),
("Carmen", "Rodríguez Pérez", "Valencia", "634567890"),
("Sofía", "García Torres", "Sevilla", "645678901"),
("Laura", "Fernández Sánchez", "Bilbao", "656789012"),
("Marta", "Jiménez Muñoz", "Granada", "667890123"),
("Sara", "Ruiz Gómez", "Zaragoza", "678901234"),
("Paula", "Navarro Díaz", "Málaga", "689012345"),
("María", "Domínguez Romero", "Alicante", "690123456"),
("Elena", "Vargas Moreno", "Córdoba", "601234567")
]

mycursor.executemany(query2, datos_alumnas)

In [ ]:
# IMPORTANTE: HACER EL COMMIT!!!!

cnx.commit()

In [ ]:
# 5. Haz una consulta que devuelva todos los registros de la tabla "alumnas" y conviértelo en Dataframe (no te olvides del nombre de las columnas).

cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='BD_alumnas_promo_x')
mycursor = cnx.cursor()

# realizamos nuestra query
mycursor.execute("SELECT * FROM alumnas3")

mis_alumnas = mycursor.fetchall()

df_alumnas = pd.DataFrame(mis_alumnas, columns=['id_alumna', 'nombre', 'apellidos', 'ciudad', 'email'])

df_alumnas.head

<bound method NDFrame.head of     id_alumna  nombre          apellidos     ciudad      email
0          11     Ana     Martínez López  Barcelona  623456789
1          12  Carmen    Rodríguez Pérez   Valencia  634567890
2          13   Sofía      García Torres    Sevilla  645678901
3          14   Laura  Fernández Sánchez     Bilbao  656789012
4          15   Marta      Jiménez Muñoz    Granada  667890123
5          16    Sara         Ruiz Gómez   Zaragoza  678901234
6          17   Paula       Navarro Díaz     Málaga  689012345
7          18   María   Domínguez Romero   Alicante  690123456
8          19   Elena      Vargas Moreno    Córdoba  601234567
9          20   Lucía    Gómez Hernández     Madrid  612345678
10         21     Ana     Martínez López  Barcelona  623456789
11         22  Carmen    Rodríguez Pérez   Valencia  634567890
12         23   Sofía      García Torres    Sevilla  645678901
13         24   Laura  Fernández Sánchez     Bilbao  656789012
14         25   Marta      Jiménez Muñoz    Granada  667890123
15         26    Sara         Ruiz Gómez   Zaragoza  678901234
16         27   Paula       Navarro Díaz     Málaga  689012345
17         28   María   Domínguez Romero   Alicante  690123456
18         29   Elena      Vargas Moreno    Córdoba  601234567>

In [ ]:

df_alumnas = pd.read_sql_query("SELECT * FROM alumnas3", cnx)

df_alumnas.head

C:\Users\anabo\AppData\Local\Temp\ipykernel_6352\540711512.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_alumnas = pd.read_sql_query("SELECT * FROM alumnas3", cnx)

<bound method NDFrame.head of     id_alumna  nombre          apellidos     ciudad   telefono
0          11     Ana     Martínez López  Barcelona  623456789
1          12  Carmen    Rodríguez Pérez   Valencia  634567890
2          13   Sofía      García Torres    Sevilla  645678901
3          14   Laura  Fernández Sánchez     Bilbao  656789012
4          15   Marta      Jiménez Muñoz    Granada  667890123
5          16    Sara         Ruiz Gómez   Zaragoza  678901234
6          17   Paula       Navarro Díaz     Málaga  689012345
7          18   María   Domínguez Romero   Alicante  690123456
8          19   Elena      Vargas Moreno    Córdoba  601234567
9          20   Lucía    Gómez Hernández     Madrid  612345678
10         21     Ana     Martínez López  Barcelona  623456789
11         22  Carmen    Rodríguez Pérez   Valencia  634567890
12         23   Sofía      García Torres    Sevilla  645678901
13         24   Laura  Fernández Sánchez     Bilbao  656789012
14         25   Marta      Jiménez Muñoz    Granada  667890123
15         26    Sara         Ruiz Gómez   Zaragoza  678901234
16         27   Paula       Navarro Díaz     Málaga  689012345
17         28   María   Domínguez Romero   Alicante  690123456
18         29   Elena      Vargas Moreno    Córdoba  601234567>

In [ ]:
df_alumnas.head (3)

   id_alumna  nombre        apellidos     ciudad   telefono
0         11     Ana   Martínez López  Barcelona  623456789
1         12  Carmen  Rodríguez Pérez   Valencia  634567890
2         13   Sofía    García Torres    Sevilla  645678901

In [ ]:
df_alumnas.tail(3)

    id_alumna nombre         apellidos    ciudad   telefono
16         27  Paula      Navarro Díaz    Málaga  689012345
17         28  María  Domínguez Romero  Alicante  690123456
18         29  Elena     Vargas Moreno   Córdoba  601234567

In [ ]:
df_alumnas.isnull()
# df_alumnas.isnull().sum()

    id_alumna  nombre  apellidos  ciudad  telefono
0       False   False      False   False     False
1       False   False      False   False     False
2       False   False      False   False     False
3       False   False      False   False     False
4       False   False      False   False     False
5       False   False      False   False     False
6       False   False      False   False     False
7       False   False      False   False     False
8       False   False      False   False     False
9       False   False      False   False     False
10      False   False      False   False     False
11      False   False      False   False     False
12      False   False      False   False     False
13      False   False      False   False     False
14      False   False      False   False     False
15      False   False      False   False     False
16      False   False      False   False     False
17      False   False      False   False     False
18      False   False      False   False     False

In [ ]:
df_alumnas.isna()
df_alumnas.isna().sum()

id_alumna    0
nombre       0
apellidos    0
ciudad       0
telefono     0
dtype: int64

In [ ]:
df_alumnas.duplicated()
# df_alumnas.duplicated().sum()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
dtype: bool

In [ ]:
### Bonus:

# 8. Haz una consulta para extraer las diferentes ciudades en las que hay alumnas.

cnx = mysql.connector.connect(**config)
mycursor = cnx.cursor()
query = "SELECT DISTINCT(ciudad) FROM alumnas3"

mycursor.execute(query)

# 9. Crea al menos dos Dataframes con la información de las alumnas de dos ciudades diferentes (usando dos queries).

In [ ]:
for x in mycursor:
    print(x)

('Barcelona',)
('Valencia',)
('Sevilla',)
('Bilbao',)
('Granada',)
('Zaragoza',)
('Málaga',)
('Alicante',)
('Córdoba',)
('Madrid',)

In [ ]:
# 9. Crea al menos dos Dataframes con la información de las alumnas de dos ciudades diferentes (usando dos queries).

cnx = mysql.connector.connect(**config)
mycursor = cnx.cursor()
query = """ SELECT * FROM alumnas3"""

mycursor.execute(query)

primera_alumna = mycursor.fetchone()
segunda_alumna = mycursor.fetchone()

df1 = pd.DataFrame(primera_alumna)
df2 = pd.DataFrame(segunda_alumna)

In [ ]:
df1.head()

                0
0              11
1             Ana
2  Martínez López
3       Barcelona
4       623456789

In [ ]:
df2.head()

                 0
0               12
1           Carmen
2  Rodríguez Pérez
3         Valencia
4        634567890